# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [3]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

### Step 3. Assign it to a variable called users.

In [5]:
users = pd.read_csv(url, sep = '|')
users.sample()

     user_id  age gender occupation zip_code
690      691   34      M   educator    60089

### Step 4. Discover what is the mean age per occupation

In [6]:
users.groupby('occupation')['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [43]:
round(users.groupby('occupation')['gender'].apply(lambda x: (x == 'M').sum()) / users.groupby('occupation')['gender'].count(), 2).sort_values(ascending=False)

occupation
doctor           1.00
engineer         0.97
technician       0.96
retired          0.93
executive        0.91
programmer       0.91
scientist        0.90
entertainment    0.89
lawyer           0.83
salesman         0.75
educator         0.73
student          0.69
other            0.66
marketing        0.62
writer           0.58
none             0.56
administrator    0.54
artist           0.54
librarian        0.43
healthcare       0.31
homemaker        0.14
Name: gender, dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [45]:
users.groupby('occupation')['age'].agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [50]:
users.groupby(['occupation', 'gender']).age.agg('mean').round(2)

occupation     gender
administrator  F         40.64
               M         37.16
artist         F         30.31
               M         32.33
doctor         M         43.57
educator       F         39.12
               M         43.10
engineer       F         29.50
               M         36.60
entertainment  F         31.00
               M         29.00
executive      F         44.00
               M         38.17
healthcare     F         39.82
               M         45.40
homemaker      F         34.17
               M         23.00
lawyer         F         39.50
               M         36.20
librarian      F         40.00
               M         40.00
marketing      F         37.20
               M         37.88
none           F         36.50
               M         18.60
other          F         35.47
               M         34.03
programmer     F         32.17
               M         33.22
retired        F         70.00
               M         62.54
salesman       F         27.00
               M         38.56
scientist      F         28.33
               M         36.32
student        F         20.75
               M         22.67
technician     F         38.00
               M         32.96
writer         F         37.63
               M         35.35
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [82]:
users.groupby('occupation')['gender'].value_counts(normalize=True).round(2)

occupation     gender
administrator  M         0.54
               F         0.46
artist         M         0.54
               F         0.46
doctor         M         1.00
educator       M         0.73
               F         0.27
engineer       M         0.97
               F         0.03
entertainment  M         0.89
               F         0.11
executive      M         0.91
               F         0.09
healthcare     F         0.69
               M         0.31
homemaker      F         0.86
               M         0.14
lawyer         M         0.83
               F         0.17
librarian      F         0.57
               M         0.43
marketing      M         0.62
               F         0.38
none           M         0.56
               F         0.44
other          M         0.66
               F         0.34
programmer     M         0.91
               F         0.09
retired        M         0.93
               F         0.07
salesman       M         0.75
               F         0.25
scientist      M         0.90
               F         0.10
student        M         0.69
               F         0.31
technician     M         0.96
               F         0.04
writer         M         0.58
               F         0.42
Name: gender, dtype: float64